app/controllers/conversations_controller.rb

  def index
    @users = User.where.not(id: current_user.id)
    @conversations = Conversation.where("sender_id = ? OR receiver_id = ?", current_user.id, current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."sender_id" = $1  [["sender_id", 1]]

  def show
    @conversations = Conversation.find(params[:id])
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    if Conversation.between(params[:sender_id], params[:receiver_id]).present?
      @conversation = Conversation.between(params[:sender_id], params[:receiver_id]).first
    else
      @conversation = Conversation.create!(conversation_params)
---
SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = 2 AND conversations.receiver_id = 4) OR (conversations.receiver_id = 4 AND conversations.sender_id = 2)) ORDER BY "conversations"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "conversations" WHERE "conversations"."sender_id" = $1 AND "conversations"."receiver_id" = $2 LIMIT $3  [["sender_id", 4], ["receiver_id", 3], ["LIMIT", 1]]
INSERT INTO "conversations" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 4], ["receiver_id", 3], ["created_at", "2017-07-21 12:36:29.779513"], ["updated_at", "2017-07-21 12:36:29.779513"]]