app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["conversation_id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]
UPDATE "messages" SET "read" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["read", "t"], ["updated_at", "2017-07-21 12:41:10.183392"], ["id", 2]]
---
  def index
    @messages = @conversation.messages

      p @messages.last
      @messages.where.not(user_id: current_user.id).update_all(read: true)

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "This is a test message"], ["conversation_id", 1], ["user_id", 3], ["created_at", "2017-07-21 12:39:52.682512"], ["updated_at", "2017-07-21 12:39:52.682512"]]
---
  def create
    @message = @conversation.messages.new(message_params)
    @message.user_id = current_user.id

    if @message.save