app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "project_deadline", "bid_deadline", "tech_stack", "is_priority", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @project = Project.new(project_params)
    @project.user = current_user

    if @project.save