app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.creator = current_user

    if @review.save
---
INSERT INTO "reviews" ("body", "rating", "created_at", "updated_at", "creator_id", "receiver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "liewjfi/wjf"], ["rating", 3], ["created_at", "2017-07-22 13:57:35.567518"], ["updated_at", "2017-07-22 13:57:35.567518"], ["creator_id", 4], ["receiver_id", 3]]