app/controllers/tenders_controller.rb

  def index
    @tenders = Tender.all
---
SELECT "tenders".* FROM "tenders"

  def create
    @tender = Tender.new(tender_params)
    @tender.user = current_user

    if @tender.save
---
INSERT INTO "tenders" ("bid", "pitch", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"