app/controllers/users_controller.rb

INSERT INTO "users" ("username", "firstname", "lastname", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "testuser"], ["firstname", "test"], ["lastname", "user"], ["created_at", "2017-07-21 09:26:04.851076"], ["updated_at", "2017-07-21 09:26:04.851076"], ["email", "test@user.com"]]
---
  def create
    @user = User.new(user_params)

    if @user.save